/******************* (C) COPYRIGHT 2015 ZJU-StormLand *************************
**               		      ROS_hydraulic
**					  ROS_hydraulic_Function_Realization.c
**
** 				 		      ZJU - 2015
**
** 系统介绍：
**			 
** 系统说明：
**
** 文 件 名：ROS_hydraulic_conf.h
** 模 块 名：用于配置特定液压系统中的功能全局变量并赋初值及整体功能实现
** 功能描述：xxxxxxxxxxxxxxxx
** 其他说明：
**
** 创 建 人：陆振宇
** 创建时间：2015-05-31
** ----------------------------------------------------------------------------
** 修 改 人：陆振宇
** 修改时间：2015-05-31
** 修改说明：
** ----------------------------------------------------------------------------
** 修 改 人：陆振宇
** 修改时间：2015-05-31
** 修改说明：
** ----------------------------------------------------------------------------
*******************************************************************************/	

/* ------------------------------头文件包含-----------------------------------*/
#include "ROS_hydraulic_Function_Realization.h"
/* --------------------------------宏指令-------------------------------------*/

/* ---------------------------------全局变量----------------------------------*/

/* ---------------------------------静态变量----------------------------------*/

/* ----------------------------------函数-------------------------------------*/

/********************************************************************************
** 函 数 名：ProportionalValve_MainSpool_PositionTrack_Control()
** 功能描述：先导式比例阀_主阀位移跟踪控制
** 其他说明：XXXXXXXXXXXXXXXXXXXX
** 全局变量：
** 调用函数：
** 入口参数：
** 出口参数：
**
** 作    者：陆振宇
** 创建时间：2015-05-31
** -------------------------------------------------------------------------------
** 修 改 人：
** 修改时间：
** 修改说明：
** -------------------------------------------------------------------------------
**********************************************************************************/
void ProportionalValve_MainSpool_PositionTrack_Control(void)
{
	InputSignal_MainValve_Postion(&MainValve);
	Elements_MainValvePosition_Acquisition(&MainValve);
	ControlAlgorithm_PositionPID(&PID_MainValve_Position);

	SolenoidA.Reference_Current=PID_MainValve_Position.Output;
	SubElements_PropertionalSolenoid_Current_Filter_Acquisition(&SolenoidA);
	SubElements_PropertionalSolenoid_Current_PIDTrack(&PID_SolenoidA_Current);
	SubElements_PropertionalSolenoid_PWM_Control(PID_SolenoidA_Current.Output,PWM_Period,&SolenoidA);

	SolenoidB.Reference_Current=PID_MainValve_Position.Output;
	SubElements_PropertionalSolenoid_Current_Filter_Acquisition(&SolenoidB);
	SubElements_PropertionalSolenoid_Current_PIDTrack(&PID_SolenoidB_Current);
	SubElements_PropertionalSolenoid_PWM_Control(PID_SolenoidB_Current.Output,PWM_Period,&SolenoidB);			
}

/********************************************************************************
** 函 数 名：ProportionalValve_PilotSpool_PositionTrack_Control()
** 功能描述：先导式比例阀_先导阀位移跟踪控制
** 其他说明：控制先导阀阀芯位移
** 全局变量：
** 调用函数：
** 入口参数：
** 出口参数：
**
** 作    者：陆振宇
** 创建时间：2015-05-31
** -------------------------------------------------------------------------------
** 修 改 人：
** 修改时间：
** 修改说明：
** -------------------------------------------------------------------------------
**********************************************************************************/
void ProportionalValve_PilotSpool_PositionTrack_Control()
{
}

/********************************************************************************
** 函 数 名：ProportionalValve_PilotSpool_ONOFF_Control()
** 功能描述：先导式比例阀_先导阀开关控制
** 其他说明：直接开关控制
** 全局变量：
** 调用函数：
** 入口参数：
** 出口参数：
**
** 作    者：陆振宇
** 创建时间：2015-05-31
** -------------------------------------------------------------------------------
** 修 改 人：
** 修改时间：
** 修改说明：
** -------------------------------------------------------------------------------
**********************************************************************************/
void ProportionalValve_PilotSpool_ONOFF_Control()
{
}

/********************************************************************************
** 函 数 名：ProportionalValve_pilot_port_Control()
** 功能描述：先导式比例阀_先导阀开口控制
** 其他说明：提供电流控制开口大小
** 全局变量：
** 调用函数：
** 入口参数：
** 出口参数：
**
** 作    者：陆振宇
** 创建时间：2015-05-31
** -------------------------------------------------------------------------------
** 修 改 人：
** 修改时间：
** 修改说明：
** -------------------------------------------------------------------------------
**********************************************************************************/
void ProportionalValve_PilotPort_Control()
{
}

/********************************************************************************
** 函 数 名：ProportionalValve_Communication()
** 功能描述：先导式比例阀_通信功能实现
** 其他说明：xxxxx
** 全局变量：
** 调用函数：
** 入口参数：
** 出口参数：
**
** 作    者：陆振宇
** 创建时间：2015-05-31
** -------------------------------------------------------------------------------
** 修 改 人：
** 修改时间：
** 修改说明：
** -------------------------------------------------------------------------------
**********************************************************************************/
void ProportionalValve_Communication()
{
}

/********************************************************************************
** 函 数 名：ProportionalValve_Alarm()
** 功能描述：先导式比例阀_报警功能实现
** 其他说明：xxxxx
** 全局变量：
** 调用函数：
** 入口参数：
** 出口参数：
**
** 作    者：陆振宇
** 创建时间：2015-05-31
** -------------------------------------------------------------------------------
** 修 改 人：
** 修改时间：
** 修改说明：
** -------------------------------------------------------------------------------
**********************************************************************************/
void ProportionalValve_Alarm()
{
}

/********************************************************************************
** 函 数 名：ProportionalValve_DetectionDiagnosis()
** 功能描述：先导式比例阀_检测与诊断功能实现
** 其他说明：xxxxx
** 全局变量：
** 调用函数：
** 入口参数：
** 出口参数：
**
** 作    者：陆振宇
** 创建时间：2015-05-31
** -------------------------------------------------------------------------------
** 修 改 人：
** 修改时间：
** 修改说明：
** -------------------------------------------------------------------------------
**********************************************************************************/
void ProportionalValve_DetectionDiagnosis()
{
}

/********************************************************************************
** 函 数 名：ProportionalValve_Log()
** 功能描述：先导式比例阀_日志功能实现
** 其他说明：xxxxx
** 全局变量：
** 调用函数：
** 入口参数：
** 出口参数：
**
** 作    者：陆振宇
** 创建时间：2015-05-31
** -------------------------------------------------------------------------------
** 修 改 人：
** 修改时间：
** 修改说明：
** -------------------------------------------------------------------------------
**********************************************************************************/
void ProportionalValve_Log()
{
}
